
# -*- encoding: utf-8 -*-


class Charsets(object):
    BQTGrk = [
    ['A', 'Α'], ['B', 'Β'], ['G', 'Γ'], ['D', 'Δ'], ['E', 'Ε'], ['Z', 'Ζ'], ['H', 'Η'],
    ['Q', 'Θ'], ['I', 'Ι'], ['K', 'Κ'], ['L', 'Λ'], ['M', 'Μ'], ['N', 'Ν'], ['X', 'Ξ'],
    ['O', 'Ο'], ['P', 'Π'], ['R', 'Ρ'], ['S', 'Σ'], ['T', 'Τ'], ['U', 'Υ'], ['F', 'Φ'],
    ['C', 'Χ'], ['Y', 'Ψ'], ['W', 'Ω'], ['a', 'α'], ['b', 'β'], ['g', 'γ'], ['d', 'δ'],
    ['e', 'ε'], ['z', 'ζ'], ['h', 'η'], ['q', 'θ'], ['i', 'ι'], ['k', 'κ'], ['l', 'λ'],
    ['m', 'μ'], ['n', 'ν'], ['x', 'ξ'], ['o', 'ο'], ['p', 'π'], ['r', 'ρ'], ['V', 'ς'],
    ['s', 'σ'], ['t', 'τ'], ['u', 'υ'], ['f', 'φ'], ['c', 'χ'], ['y', 'ψ'], ['w', 'ω'],
    ['J', 'ϑ'], ['j', 'ϕ'], ['v', 'ς'], ['"', '᾽'], ['#', '῎'], ['$', '῎'], ['%', '῞'],
    ["'",'᾽'], ['+', '΅'], ['/', '΄'], [':', '῾'], [';', '῾'], ['\\', '`'],['^', '῞'],
    ['`', 'ͺ']
    ]

    BQTHeb = [
    ['"', '‍ַ'], ['#', 'ֲ'], ['$', '‍ֳ'], ['%', 'ֱ'], ["'",'‍ַ'], ['+', 'ּ'], ['/', 'ָ'],
    [';', 'ְ'], ['=', 'ּ'], ['C', 'ֻ'], ['F', 'ֹ‍ׂ'], ['I', 'ִ'], ['K', 'ך'], ['M', 'ם'],
    ['N', 'ן'], ['P', 'ף'], ['S', '‍ׂ'], ['U', 'ץ'], ['V', 'ׁ'], ['[', 'ֵ'], ['\\', '‍ׇ'],
    [']', 'ֶ'], ['_', 'ְ'], ['a', 'א'], ['b', 'ב'], ['c', 'ֻ'], ['d', 'ד'], ['e', 'ע'],
    ['f', '‍ֹ'], ['g', 'נ'], ['h', 'ה'], ['i', '‍ׅ'], ['j', 'ט'], ['k', 'כ'], ['l', 'ל'],
    ['m', 'מ'], ['n', 'נ'], ['o', 'ס'], ['p', 'פ'], ['q', 'ק'], ['r', 'ר'], ['s', 'ש'],
    ['t', 'ת'], ['u', 'צ'], ['v', 'ש'], ['w', 'ו'], ['x', 'ח'], ['y', 'י'], ['z', 'ז'],
    ['{', 'ֵ'], ['}', 'ֶ']
    ]


# пояснение: 1 - стронги на иврите, 2- стронги греческие, 3 -другое
TableBooks = [
    ['Genesis',         'Gen',      1], #от сюда иврит
    ['Exodus',          'Exod',     1], ['Leviticus',       'Lev',      1],
    ['Numbers',         'Num',      1], ['Deuteronomy',     'Deut',     1],
    ['Joshua',          'Josh',     1], ['Judges',          'Judg',     1],
    ['Ruth',            'Ruth',     1], ['1Samuel',         '1Sam',     1],
    ['2Samuel',         '2Sam',     1], ['1Kings',          '1Kgs',     1],
    ['2Kings',          '2Kgs',     1], ['1Chron',          '1Chr',     1],
    ['2Chron',          '2Chr',     1], ['Ezra',            'Ezra',     1],
    ['Nehemiah',        'Neh',      1], ['Esther',          'Esth',     1],
    ['Job',             'Job',      1], ['Psalm',           'Ps',       1],
    ['Proverbs',        'Prov',     1], ['Ecclesia',        'Eccl',     1],
    ['Song',            'Song',     1], ['Isaiah',          'Isa',      1],
    ['Jeremiah',        'Jer',      1], ['Lament',          'Lam',      1],
    ['Ezekiel',         'Ezek',     1], ['Daniel',          'Dan',      1],
    ['Hosea',           'Hos',      1], ['Joel',            'Joel',     1],
    ['Amos',            'Amos',     1], ['Obadiah',         'Obad',     1],
    ['Jonah',           'Jonah',    1], ['Micah',           'Mic',      1],
    ['Nahum',           'Nah',      1], ['Habakkuk',        'Hab',      1],
    ['Zephaniah',       'Zeph',     1], ['Haggai',          'Hag',      1],
    ['Zechariah',       'Zech',     1],
    ['Malachi',         'Mal',      1], # до сюда
    ['Matthew',         'Matt',     2], # от сюда греческие
    ['Mark',            'Mark',     2], ['Luke',            'Luke',     2],
    [' John',           'John',     2], ['Acts',            'Acts',     2],
    ['James',           'Jas',      2], ['1Peter',          '1Pet',     2],
    ['2Peter',          '2Pet',     2], ['1John',           '1John',    2],
    ['2John',           '2John',    2], ['3John',           '3John',    2],
    ['Jude',            'Jude',     2], ['Romans',          'Rom',      2],
    ['1Corinthians',    '1Cor',     2], ['2Corinthians',    '2Cor',     2],
    ['Galatians',       'Gal',      2], ['Ephesian',        'Eph',      2],
    ['Philippians',     'Phil',     2], ['Colossians',      'Col',      2],
    ['1Thessalonians',  '1Thess',   2], ['2Thessalonians',  '2Thess',   2],
    ['1Timothy',        '1Tim',     2], ['2Timothy',        '2Tim',     2],
    ['Titus',           'Titus',    2], ['Philemon',        'Phlm',     2],
    ['Hebrews',         'Heb',      2],
    ['Revelation',      'Rev',      2], # до сюда
    ['1Мак',            '1Mac',     3], ['2Мак',            '2Mac',     3],
    ['3Мак',            '3Mac',     3], ['Варух',           'Bar',      3],
    ['2Ездр',           '2Esd',     3], ['3Ездр',           '3Esd',     3],
    ['Иудиф',           'Judith',   3], ['Посл.Иер.',       'EpJer',    3],
    ['Прем.Сол.',       'WSo',      3], ['Сир',             'Sir',      3],
    ['Тов.',            'Tob',      3], ['Прим.',           'Prim',     3],
    ]

JustBooks = ['Book', 'Apocrypha']
